// จงเขียนโปรแกรมภาษาจาวาทายตัวเลขจำนวนเต็มที่โปรแกรมตั้งเอาไว้ ทั้งนี้ให้โปรแกรมสุ่มเลข Bingo ขึ้นมำ ซึ่งมีค่าไม่เกิน 99 โดย การทำงานให้ผู้ใช้ป้อนตัวเลขที่ต้องการทายทางแป้นพิมพ์ หากเลขที่ผู้ใช้ป้อนตรงกับที่ โปรแกรมตั้งเอาไว้ให้แสดงข้อความ "ตัวเลขที่ทายถูกต้อง" และจบกำรทำงาน หากไม่ตรงให้แสดงข้อความ "ตัวเลขที่ทายไม่ถูกต้อง กรุณาทายใหม่" ทางหน้าจอ แล้วให้ผู้ใช้ทายตัวเลขใหม่จนกว่าจะถูกถึงจะจบการทำงาน 
// +++++++++++++++++++++++ 
// โปรแกรม Bingo V.1.2 
// +++++++++++++++++++++++ 
// กรุณาป้อนตัวเลขที่ต้องการทาย 0-99 : <input> 
// +++++++++++++++++++++++ 
// ตัวเลขที่ทายถูกต้องแล้วคร๊าบ... และบอกด้วยว่า ตัวเลขที่ทายไม่ถูกต้อง ทายมากไป หรือ ทายน้อยไป กรุณาทายใหม่คร๊าบบ... +++++++++++++++++++++++
// ถ้าทายไม่ถูกเกินสิบครั้งจึงจะหยุดการทำงานและแสดงข้อความ "ทายใหม่น้า ^_^" และจบการทำงาน

package com.javahomework;

import java.util.Random;
import java.util.Scanner;

public class Javahomework06 {

    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        Random random = new Random();

        System.out.println("================================");
        System.out.println("โปรแกรม Bingo V.1.2");
        System.out.println("================================");

        int num = random.nextInt(100);
        int guess = 0;
        int count = 0;

        while (num != guess) {
            System.out.print("กรุณาป้อนตัวเลขที่ต้องการทาย 0-99 : ");
            guess = scanner.nextInt();
            count++;
            if (num == guess) {
                System.out.println("+++++++++++++++++++++++++++++++");
                System.out.println("ตัวเลขที่ทายถูกต้องแล้วคร๊าบ...");
            } else if (num > guess) {
                System.out.println("+++++++++++++++++++++++++++++++");
                System.out.println("ตัวเลขที่ทายไม่ถูกต้องทายมากไปกรุณาทายใหม่คร๊าบบ...");
            } else if (num < guess) {
                System.out.println("+++++++++++++++++++++++++++++++");
                System.out.println("ตัวเลขที่ทายไม่ถูกต้องทายน้อยไปกรุณาทายใหม่คร๊าบบ...");
            }
            if (count == 10) {
                System.out.println("+++++++++++++++++++++++++++++++");
                System.out.println("ทายใหม่น้า ^_^");
                break;
            }
        }
        System.out.println("================================");
    }
}
